import {useEffect} from "react";

const Assistance = () => {
    useEffect(() => {
        window.scrollTo(0, 0);
    }, []);

    return (
        <div>
            <h1>Рахунки на які можна надіслати гроші для підтримки ЗСУ</h1>

            <ul>
                <li><strong>Спеціальний рахунок для збирання коштів на підтримку Збройних сил України,
                    відкритий Національним банком.</strong> Переказати гроші можуть міжнародні
                    партнери та донори, український бізнес та громадяни.
                    Відправити кошти можна у доларах США, євро, британських фунтах та українській гривні.

                    Реквізити офіційного спеціального рахунку: UA8430000100000047330992708

                    <a href="https://bank.gov.ua/ua/news/all/natsionalniy-bank-vidkriv-spetsrahunok-dlya-zboru-koshtiv-na-potrebi-armiyi"
                       target="_blank" rel="nofollow noopener"> <b>Деталі щодо реквізитів. </b></a>

                    Тим, хто живе за кордоном, спростили шлях для підтримки української армії. Тепер
                    замість SWIFT-платежів WayForPay приймає гроші з будь-якої карти світу, оплати
                    GooglePay, ApplePay, UnionPay. Кошти надходять безпосередньо на рахунок НБУ до Фонду
                    підтримки Української Армії.
                    <li>Як це зробити:</li>
                    <p>1) посилання для оплат для пересилки у месенджерах:
                        https://secure.wayforpay.com/payment/ukraine.army
                        <p>2) для розміщення на сайті або в додатку необхідно вставити код Допомогти
                            Армії</p>
                        3) для розміщення у соцмережах:
                        https://secure.wayforpay.com/payment/ukraine.army.
                    </p>
                    <li><strong>Міністерство оборони також приймає прямі платежі</strong> на
                        матеріально-технічне та медичне забезпечення Збройних Сил.

                        Реквізити рахунку: UA458201720313281002302018611

                        Деталі щодо реквізитів <a
                            href="https://www.mil.gov.ua/dopomoga-na-materialno-tehnichne-ta-medichne-zabezpechennya-zbrojnih-sil-ukraini.html"
                            rel="nofollow noopener" target="_blank"><b>тут</b>.</a></li>
                </li>
                <p>
                    Також, можна підтримати українську армію через <strong>проєкт United24.</strong> В
                    рамках цієї ініціативи можна обрати або допомогу армії, або перерахувати гроші
                    на «Гуманітарне розмінування», «Медична допомога», «Відбудова України»,
                    «Освіта та наука». Під кожний з напрямків відкрито окремий рахунок в Національному
                    банку України згідно з цією постановою Кабінету Міністрів. <a
                    href="https://u24.gov.ua/uk" rel="nofollow noopener"
                    target="_blank"><b>Перейти на сайт United24.</b></a>
                    li><strong>Громадські організації та фонди допомоги ЗСУ:</strong></p>
                <strong>Фонд «Повернися живим». Найбільший фонд, який допомагає Збройним Силам
                    України</strong>

                Підтримати армію з картки будь-якого банку:
                IBAN: UA223226690000026007300905964
                ЄДРПОУ: 39696398
                Благодійна Організація «Міжнародний благодійний фонд «Повернись живим»
                Призначення платежу: Допомога ЗСУ.
                <li>За детальною інформацією, зокрема щодо витрат, можна стежити на офіційному сайті
                    фонду: <a
                        href="https://savelife.in.ua/sniping/?gad_source=1&gclid=CjwKCAiAuNGuBhAkEiwAGId4aqawtv8HmWxbWh6-OYS5PHZWs_eureLKuMDJDWZbmOP7uI5XTzrJoxoC8vMQAvD_BwE"
                        rel="nofollow noopener"
                        target="_blank"><b>Повернись живим.</b></a></li>

                <p><strong>Фонд «Сприяння обороні України». </strong></p>
                Потребується допомога, а саме:
                кошти на купівлю сучасного медичного обладнання,
                реанімаційних пристроїв та апаратів штучної вентиляції легень.
                Також потрібні кошти на купівлю апаратів, необхідних для лікування поранених.
                <p>Розрахунки в іноземній валюті:</p>
                IBAN: UA843000010000026004180020179
                Банк: Державний ощадний банк України
                МФО: 320649
                Код ЄДРПОУ: 42716563
                Одержувач: БФ "Сприяння обороні України"
                Код ЄДРПОУ: 42716563
                Призначення платежу: благодійний внесок (зазначте, яку саме допомогу ви
                надаєте).
                <p>Розрахунки в гривнях:</p>
                UA433206490000026007300690991
                Банк: Державний ощадний банк України
                МФО: 320649
                Код ЄДРПОУ: 42716563
                Одержувач: БФ "Сприяння обороні України"
                Код ЄДРПОУ: 42716563
                Призначення платежу: благодійний внесок (зазначте, яку саме допомогу ви
                надаєте).

                <p><strong>Фонд "Мир і Кіборг"</strong><p>
                    Для того, щоб надати допомогу ЗСУ, вам потрібно перерахувати гроші на
                    картку</p>
                    IBAN: UA303206490000026007300698510
                    МФО: 320649
                    Отримувач: ФО «ФОНД МИР И КИБОРГ»</p>
                <p>
                    <strong>Фонд Благодійної допомоги пораненим бійцям “СЕРЦЕ до СЕРЦЯ”</strong>
                    Онлайн перекази на картку Приватбанку: 5168 7423 5758 5921
                    Отримувач: ГО «Фонд Благодійної допомоги пораненим бійцям “СЕРЦЕ до
                    СЕРЦЯ”.Призначення платежу: благодійний внесок (зазначте, яку саме допомогу ви
                    надаєте).
                    <p>Також є можливість допомогти через інші фонди і благодійні організації, такі
                    як: Фонд Ігоря Беркута, Фонд “Благомай”, Фонд “Народна Армія”, Благодійний
                    фонд “Солдатам Західних областей”, Благодійний фонд “Волонтерська Сотня” та
                    багато інших. <p>Tакож є можливість підтримати армію через
                        благодійні кампанії, які організовують компанії та громадські ініціативи.
                        Прикладом є акції від брендів одягу та інших товарів, які перераховують
                        частину виручених коштів на потреби Збройних Сил України.</p></p>
                    Додатково, можна взяти участь у програмах волонтерських організацій, які надають
                    підтримку Збройним Силам України та воїнам на передовій.
                    <b>Важливо зазначити, що перед тим, як перерахувати гроші на будь-який рахунок, слід
                    перевірити достовірність інформації та переконатися, що це справжній рахунок
                    благодійної організації чи фонду.</b>
                </p>

            </ul>

        </div>
)
}

export {
    Assistance
}
